import Image from 'next/image';
import React, { useState } from 'react';

const Biography = () => {
  const [showMore,setShowMore] = useState<boolean>(false);
  return (
    <section 
    
     data-aos="fade-up"
      data-aos-duration="2000"
    
    className='flex justify-center item-center '>
  
 <div className='lg:max-w-6xl max-w-[300px] md:max-w-[600px] bg-white lg:px-10 p-5 relative -top-32 shadow-xl'>
     <h3 className='text-xl md:text-3xl lg:text-4xl text-blue-950 font-semibold text-center mb-2'>Biography of <span className='text-orange-500 text-bold'>M.R. Millat</span></h3>
     <p className='text-sm font-semibold text-center mb-8'> Politician of Bangladesh Nationalist Party and a former member of parliament for Jamalpur-1.</p>
     <div className="overflow-hidden mb-8 w-full md:h-[400px] lg:h-[500px] h-[300px] relative"> <Image
      src="/Images/mr-8.jpg"
      alt="Event Image"
      width={1600}
      height={1600}
     className="w-full duration-500  hover:scale-110   h-full  object-cover shadow-md"
    /></div>

    {
      showMore?  
      <p>
      এম রশিদুজ্জামান মিল্লাত বাংলাদেশ জাতীয়তাবাদী দলের রাজনীতিবিদ। তিনি জামালপুর-১ (দেওয়ানগঞ্জ-বকশীগঞ্জ) আসনে ২০০১ সালে প্রথমবার এমপি নির্বাচিত হন।বর্তমান বাংলাদেশ জাতীয়তাবাদী দল বিএনপির কোষাধ্যক্ষ।এবং আমরা বিএনপি পরিবার সেলের উপদেষ্টা হিসেবে দায়িত্ব পালন করছেন।তিনি জামালপুর জেলা বিএনপির সাবেক সভাপতি।
      এম রশিদুজ্জামান মিল্লাত জামালপুর জেলার দেওয়ানগঞ্জ উপজেলায় জন্মগ্রহণ করেন।
      এম রশিদুজ্জামান মিল্লাত দেওয়ানগঞ্জ উপজেলা বিএনপির সভাপতি ও কেন্দ্রীয় কমিটির কোষাধ্যক্ষ।তিনি জামালপুর জেলা বিএনপির সাবেক সভাপতি ছিলেন।২০০১ সালে অষ্টম জাতীয় সংসদ সদস্য নির্বাচনে প্রথমবার অংশগ্রহণ করে সংসদ সদস্য নির্বাচিত হন।[১] ব্যাপকভাবে উন্নয়ন করাই দেওয়ানগঞ্জ-বকশিগঞ্জ উপজেলার সর্বস্তরের জনগনের নেতাই পরিনত হন।জামালপুর-১আসনের সবচেয়ে জনপ্রিয় নেতা মিল্লাত। তিনি উপজেলার বাহাদুরাবাদে পুরাতন ব্রহ্মপুত্র নদের উপর সেতু নির্মাণ করে,দেওয়ানগঞ্জ উপজেলা সদরের সাথে উত্তর অঞ্চল(উপজেলার উত্তরের ইউনিয়ন,বকশিগঞ্জ উপজেলা,কুড়িগ্রাম জেলার, রৌমারী চর রাজিবপুর) এর সাথে সরাসরি সড়ক ও রেলপথে রাজধানীর সাথে যোগাযোগ স্থাপনের ব্যাবস্থা করেন।
      এম রশিদুজ্জামান মিল্লাত বাংলাদেশ জাতীয়তাবাদী দলের রাজনীতিবিদ। তিনি জামালপুর-১ (দেওয়ানগঞ্জ-বকশীগঞ্জ) আসনে ২০০১ সালে প্রথমবার এমপি নির্বাচিত হন।বর্তমান বাংলাদেশ জাতীয়তাবাদী দল বিএনপির কোষাধ্যক্ষ।এবং আমরা বিএনপি পরিবার সেলের উপদেষ্টা হিসেবে দায়িত্ব পালন করছেন।তিনি জামালপুর জেলা বিএনপির সাবেক সভাপতি।
      এম রশিদুজ্জামান মিল্লাত জামালপুর জেলার দেওয়ানগঞ্জ উপজেলায় জন্মগ্রহণ করেন।
      এম রশিদুজ্জামান মিল্লাত দেওয়ানগঞ্জ উপজেলা বিএনপির সভাপতি ও কেন্দ্রীয় কমিটির কোষাধ্যক্ষ।তিনি জামালপুর জেলা বিএনপির সাবেক সভাপতি ছিলেন।২০০১ সালে অষ্টম জাতীয় সংসদ সদস্য নির্বাচনে প্রথমবার অংশগ্রহণ করে সংসদ সদস্য নির্বাচিত হন।[১] ব্যাপকভাবে উন্নয়ন করাই দেওয়ানগঞ্জ-বকশিগঞ্জ উপজেলার সর্বস্তরের জনগনের নেতাই পরিনত হন।জামালপুর-১আসনের সবচেয়ে জনপ্রিয় নেতা মিল্লাত। তিনি উপজেলার বাহাদুরাবাদে পুরাতন ব্রহ্মপুত্র নদের উপর সেতু নির্মাণ করে,দেওয়ানগঞ্জ উপজেলা সদরের সাথে উত্তর অঞ্চল(উপজেলার উত্তরের ইউনিয়ন,বকশিগঞ্জ উপজেলা,কুড়িগ্রাম জেলার, রৌমারী চর রাজিবপুর) এর সাথে সরাসরি সড়ক ও রেলপথে রাজধানীর সাথে যোগাযোগ স্থাপনের ব্যাবস্থা করেন।২০০১ সালে অষ্টম জাতীয় সংসদ সদস্য নির্বাচনে প্রথমবার অংশগ্রহণ করে সংসদ 

      <button onClick={()=>setShowMore(!showMore)} className='text-blue-500'>View Less</button>
      
      </p>
      :
      <p>
      এম রশিদুজ্জামান মিল্লাত বাংলাদেশ জাতীয়তাবাদী দলের রাজনীতিবিদ। তিনি জামালপুর-১ (দেওয়ানগঞ্জ-বকশীগঞ্জ) আসনে ২০০১ সালে প্রথমবার এমপি নির্বাচিত হন।বর্তমান বাংলাদেশ জাতীয়তাবাদী দল বিএনপির কোষাধ্যক্ষ।এবং আমরা বিএনপি পরিবার সেলের উপদেষ্টা হিসেবে দায়িত্ব পালন করছেন।তিনি জামালপুর জেলা বিএনপির সাবেক সভাপতি।
      এম রশিদুজ্জামান মিল্লাত জামালপুর জেলার দেওয়ানগঞ্জ উপজেলায় জন্মগ্রহণ করেন।
      এম রশিদুজ্জামান মিল্লাত দেওয়ানগঞ্জ উপজেলা বিএনপির সভাপতি ও কেন্দ্রীয় কমিটির কোষাধ্যক্ষ।তিনি জামালপুর জেলা বিএনপির সাবেক সভাপতি ছিলেন।
      <span onClick={()=>setShowMore(!showMore)} className='text-blue-500'>...View More</span>
      </p>
    }
   
    </div>
  </section>  
  );
};

export default Biography;