import Image from 'next/image';
import React from 'react';
import { FaCalendar } from 'react-icons/fa';
import { FaLocationDot } from 'react-icons/fa6';

const eventDetails = () => {
  return (
    <div className="w-full    ">
  <div className="px-5 pb-10">
    <div className='h-[500px]'>
    <Image
      src="/Images/mr-12.jpg"
      alt="Event Image"
      width={1600}
      height={1600}
      className="w-full h-full rounded-lg object-cover shadow-md"
    />
    </div>
    <div className="mt-4">
      <h2 className="text-xl font-bold text-blue-950">ময়মনসিংহ-কিশোরগঞ্জ রোড মার্চ এর উদ্বোধনীতে রশিদুজ্জামান মিল্লাত এর বক্তব্য  </h2>
      <div className="mt-3 text-sm opacity-80 lg:flex flex-row justify-between item-center   px-8 ">

<div className='flex gap-1 items-center '>
<span ><FaCalendar /></span><p className='text-black'><strong>Date:</strong> ১ অক্টোবর ২০২৩, রবিবার</p>
</div>
<div className='flex gap-1 items-center'>
<span ><FaLocationDot /></span><p className='text-black'><strong>Location:</strong> ১ অক্টোবর ২০২৩, রবিবার</p>
</div>

</div>
      <p className="text-sm mt-2">
     এম রশিদুজ্জামান মিল্লাত বাংলাদেশ জাতীয়তাবাদী দলের রাজনীতিবিদ। তিনি জামালপুর-১ (দেওয়ানগঞ্জ-বকশীগঞ্জ) আসনে ২০০১ সালে প্রথমবার এমপি নির্বাচিত হন।বর্তমান বাংলাদেশ জাতীয়তাবাদী দল বিএনপির কোষাধ্যক্ষ।এবং আমরা বিএনপি পরিবার সেলের উপদেষ্টা হিসেবে দায়িত্ব পালন করছেন।তিনি জামালপুর জেলা বিএনপির সাবেক সভাপতি। এম রশিদুজ্জামান মিল্লাত জামালপুর জেলার দেওয়ানগঞ্জ উপজেলায় জন্মগ্রহণ করেন। এম রশিদুজ্জামান মিল্লাত দেওয়ানগঞ্জ উপজেলা বিএনপির সভাপতি ও কেন্দ্রীয় কমিটির কোষাধ্যক্ষ।তিনি জামালপুর জেলা বিএনপির সাবেক সভাপতি ছিলেন।২০০১ সালে অষ্টম জাতীয় সংসদ সদস্য নির্বাচনে প্রথমবার অংশগ্রহণ করে সংসদ সদস্য নির্বাচিত হন।[১] ব্যাপকভাবে উন্নয়ন করাই দেওয়ানগঞ্জ-বকশিগঞ্জ উপজেলার সর্বস্তরের জনগনের নেতাই পরিনত হন।জামালপুর-১আসনের সবচেয়ে জনপ্রিয় নেতা মিল্লাত। তিনি উপজেলার বাহাদুরাবাদে পুরাতন ব্রহ্মপুত্র নদের উপর সেতু নির্মাণ করে,দেওয়ানগঞ্জ উপজেলা সদরের সাথে উত্তর অঞ্চল(উপজেলার উত্তরের ইউনিয়ন,বকশিগঞ্জ উপজেলা,কুড়িগ্রাম জেলার, রৌমারী চর রাজিবপুর) এর সাথে সরাসরি সড়ক ও রেলপথে রাজধানীর সাথে যোগাযোগ স্থাপনের ব্যাবস্থা করেন। এম রশিদুজ্জামান মিল্লাত বাংলাদেশ জাতীয়তাবাদী দলের রাজনীতিবিদ। তিনি জামালপুর-১ (দেওয়ানগঞ্জ-বকশীগঞ্জ) আসনে ২০০১ সালে প্রথমবার এমপি নির্বাচিত হন।বর্তমান বাংলাদেশ জাতীয়তাবাদী দল বিএনপির কোষাধ্যক্ষ।এবং আমরা বিএনপি পরিবার সেলের উপদেষ্টা হিসেবে দায়িত্ব পালন করছেন।তিনি জামালপুর জেলা বিএনপির সাবেক সভাপতি। এম রশিদুজ্জামান মিল্লাত জামালপুর জেলার দেওয়ানগঞ্জ উপজেলায় জন্মগ্রহণ করেন। এম রশিদুজ্জামান মিল্লাত দেওয়ানগঞ্জ উপজেলা বিএনপির সভাপতি ও কেন্দ্রীয় কমিটির কোষাধ্যক্ষ।তিনি জামালপুর জেলা বিএনপির সাবেক সভাপতি ছিলেন।২০০১ সালে অষ্টম জাতীয় সংসদ সদস্য নির্বাচনে প্রথমবার অংশগ্রহণ করে সংসদ সদস্য নির্বাচিত হন।[১] ব্যাপকভাবে উন্নয়ন করাই দেওয়ানগঞ্জ-বকশিগঞ্জ উপজেলার সর্বস্তরের জনগনের নেতাই পরিনত হন।জামালপুর-১আসনের সবচেয়ে জনপ্রিয় নেতা মিল্লাত। তিনি উপজেলার বাহাদুরাবাদে পুরাতন ব্রহ্মপুত্র নদের উপর সেতু নির্মাণ করে,দেওয়ানগঞ্জ উপজেলা সদরের সাথে উত্তর অঞ্চল(উপজেলার উত্তরের ইউনিয়ন,বকশিগঞ্জ উপজেলা,কুড়িগ্রাম জেলার, রৌমারী চর রাজিবপুর) এর সাথে সরাসরি সড়ক ও রেলপথে রাজধানীর সাথে যোগাযোগ স্থাপনের ব্যাবস্থা করেন।২০০১ সালে অষ্টম জাতীয় সংসদ সদস্য নির্বাচনে প্রথমবার অংশগ্রহণ করে সংসদ এম রশিদুজ্জামান মিল্লাত বাংলাদেশ জাতীয়তাবাদী দলের রাজনীতিবিদ। তিনি জামালপুর-১ (দেওয়ানগঞ্জ-বকশীগঞ্জ) আসনে ২০০১ সালে প্রথমবার এমপি নির্বাচিত হন।বর্তমান বাংলাদেশ জাতীয়তাবাদী দল বিএনপির কোষাধ্যক্ষ।এবং আমরা বিএনপি পরিবার সেলের উপদেষ্টা হিসেবে দায়িত্ব পালন করছেন।তিনি জামালপুর জেলা বিএনপির সাবেক সভাপতি। এম রশিদুজ্জামান মিল্লাত জামালপুর জেলার দেওয়ানগঞ্জ উপজেলায় জন্মগ্রহণ করেন। এম রশিদুজ্জামান মিল্লাত দেওয়ানগঞ্জ উপজেলা বিএনপির সভাপতি ও কেন্দ্রীয় কমিটির কোষাধ্যক্ষ।তিনি জামালপুর জেলা বিএনপির সাবেক সভাপতি ছিলেন।২০০১ সালে অষ্টম জাতীয় সংসদ সদস্য নির্বাচনে প্রথমবার অংশগ্রহণ করে সংসদ সদস্য নির্বাচিত হন।[১] ব্যাপকভাবে উন্নয়ন করাই দেওয়ানগঞ্জ-বকশিগঞ্জ উপজেলার সর্বস্তরের জনগনের নেতাই পরিনত হন।জামালপুর-১আসনের সবচেয়ে জনপ্রিয় নেতা মিল্লাত। তিনি উপজেলার বাহাদুরাবাদে পুরাতন ব্রহ্মপুত্র নদের উপর সেতু নির্মাণ করে,দেওয়ানগঞ্জ উপজেলা সদরের সাথে উত্তর অঞ্চল(উপজেলার উত্তরের ইউনিয়ন,বকশিগঞ্জ উপজেলা,কুড়িগ্রাম জেলার, রৌমারী চর রাজিবপুর) এর সাথে সরাসরি সড়ক ও রেলপথে রাজধানীর সাথে যোগাযোগ স্থাপনের ব্যাবস্থা করেন। এম রশিদুজ্জামান মিল্লাত বাংলাদেশ জাতীয়তাবাদী দলের রাজনীতিবিদ। তিনি জামালপুর-১ (দেওয়ানগঞ্জ-বকশীগঞ্জ) আসনে ২০০১ সালে প্রথমবার এমপি নির্বাচিত হন।বর্তমান বাংলাদেশ জাতীয়তাবাদী দল বিএনপির কোষাধ্যক্ষ।এবং আমরা বিএনপি পরিবার সেলের উপদেষ্টা হিসেবে দায়িত্ব পালন করছেন।তিনি জামালপুর জেলা বিএনপির সাবেক সভাপতি। এম রশিদুজ্জামান মিল্লাত জামালপুর জেলার দেওয়ানগঞ্জ উপজেলায় জন্মগ্রহণ করেন। এম রশিদুজ্জামান মিল্লাত দেওয়ানগঞ্জ উপজেলা বিএনপির সভাপতি ও কেন্দ্রীয় কমিটির কোষাধ্যক্ষ।তিনি জামালপুর জেলা বিএনপির সাবেক সভাপতি ছিলেন।২০০১ সালে অষ্টম জাতীয় সংসদ সদস্য নির্বাচনে প্রথমবার অংশগ্রহণ করে সংসদ সদস্য নির্বাচিত হন।[১] ব্যাপকভাবে উন্নয়ন করাই দেওয়ানগঞ্জ-বকশিগঞ্জ উপজেলার সর্বস্তরের জনগনের নেতাই পরিনত হন।জামালপুর-১আসনের সবচেয়ে জনপ্রিয় নেতা মিল্লাত। তিনি উপজেলার বাহাদুরাবাদে পুরাতন ব্রহ্মপুত্র নদের উপর সেতু নির্মাণ করে,দেওয়ানগঞ্জ উপজেলা সদরের সাথে উত্তর অঞ্চল(উপজেলার উত্তরের ইউনিয়ন,বকশিগঞ্জ উপজেলা,কুড়িগ্রাম জেলার, রৌমারী চর রাজিবপুর) এর সাথে সরাসরি সড়ক ও রেলপথে রাজধানীর সাথে যোগাযোগ স্থাপনের ব্যাবস্থা করেন।২০০১ সালে অষ্টম জাতীয় সংসদ সদস্য নির্বাচনে প্রথমবার অংশগ্রহণ করে সংসদ জামালপুর-১আসনের সবচেয়ে জনপ্রিয় নেতা মিল্লাত। তিনি উপজেলার বাহাদুরাবাদে পুরাতন ব্রহ্মপুত্র নদের উপর সেতু নির্মাণ করে,দেওয়ানগঞ্জ উপজেলা সদরের সাথে উত্তর অঞ্চল(উপজেলার উত্তরের ইউনিয়ন,বকশিগঞ্জ উপজেলা,কুড়িগ্রাম জেলার, রৌমারী চর রাজিবপুর) এর সাথে সরাসরি সড়ক ও রেলপথে রাজধানীর সাথে যোগাযোগ স্থাপনের ব্যাবস্থা করেন ।
      </p>
    
      
    </div>
  </div>
</div>
  );
};

export default eventDetails;